Ran Plan for dir: `root` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.cloudtrail will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cloudtrail"  {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:GetBucketAcl",
            ]
+           resources = [
+               (known after apply),
            ]
+           sid       = "AWSCloudTrailAclCheck"

+           principals {
+               identifiers = [
+                   "cloudtrail.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
+       statement {
+           actions   = [
+               "s3:PutObject",
            ]
+           resources = [
+               (known after apply),
            ]
+           sid       = "AWSCloudTrailWrite"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "bucket-owner-full-control",
                ]
+               variable = "s3:x-amz-acl"
            }

+           principals {
+               identifiers = [
+                   "cloudtrail.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # aws_cloudtrail.cloudtrail will be created
+ resource "aws_cloudtrail" "cloudtrail" {
+       arn                           = (known after apply)
+       enable_log_file_validation    = false
+       enable_logging                = true
+       home_region                   = (known after apply)
+       id                            = (known after apply)
+       include_global_service_events = true
+       is_multi_region_trail         = true
+       is_organization_trail         = false
+       name                          = "Global"
+       s3_bucket_name                = (known after apply)
+       tags_all                      = (known after apply)
    }

  # aws_cloudwatch_metric_alarm.billing will be created
+ resource "aws_cloudwatch_metric_alarm" "billing" {
+       actions_enabled                       = true
+       alarm_actions                         = [
+           "arn:aws:sns:us-east-1:098453759506:NotifyMe",
        ]
+       alarm_description                     = "Created from CloudWatch console"
+       alarm_name                            = "awsbilling-AWS-Service-Charges-total"
+       arn                                   = (known after apply)
+       comparison_operator                   = "GreaterThanThreshold"
+       datapoints_to_alarm                   = 1
+       dimensions                            = {
+           "Currency" = "USD"
        }
+       evaluate_low_sample_count_percentiles = (known after apply)
+       evaluation_periods                    = 1
+       id                                    = (known after apply)
+       metric_name                           = "EstimatedCharges"
+       namespace                             = "AWS/Billing"
+       period                                = 21600
+       statistic                             = "Maximum"
+       tags_all                              = (known after apply)
+       threshold                             = 5
+       treat_missing_data                    = "missing"
    }

  # aws_iam_account_alias.main will be created
+ resource "aws_iam_account_alias" "main" {
+       account_alias = "nosborn"
+       id            = (known after apply)
    }

  # aws_iam_account_password_policy.main will be created
+ resource "aws_iam_account_password_policy" "main" {
+       allow_users_to_change_password = true
+       expire_passwords               = (known after apply)
+       hard_expiry                    = (known after apply)
+       id                             = (known after apply)
+       max_password_age               = (known after apply)
+       minimum_password_length        = 12
+       password_reuse_prevention      = (known after apply)
+       require_lowercase_characters   = true
+       require_numbers                = true
+       require_symbols                = true
+       require_uppercase_characters   = true
    }

  # aws_s3_account_public_access_block.main will be created
+ resource "aws_s3_account_public_access_block" "main" {
+       account_id              = (known after apply)
+       block_public_acls       = true
+       block_public_policy     = false
+       id                      = (known after apply)
+       ignore_public_acls      = false
+       restrict_public_buckets = false
    }

  # aws_s3_bucket.cloudtrail will be created
+ resource "aws_s3_bucket" "cloudtrail" {
+       acceleration_status         = (known after apply)
+       acl                         = "private"
+       arn                         = (known after apply)
+       bucket                      = (known after apply)
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = "cloudtrail-"
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags_all                    = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       lifecycle_rule {
+           enabled = true
+           id      = (known after apply)

+           noncurrent_version_expiration {
+               days = 90
            }

+           noncurrent_version_transition {
+               days          = 30
+               storage_class = "STANDARD_IA"
            }

+           transition {
+               days          = 30
+               storage_class = "STANDARD_IA"
            }
        }

+       server_side_encryption_configuration {
+           rule {
+               apply_server_side_encryption_by_default {
+                   sse_algorithm = "AES256"
                }
            }
        }

+       versioning {
+           enabled    = true
+           mfa_delete = false
        }
    }

  # aws_s3_bucket.terraform will be created
+ resource "aws_s3_bucket" "terraform" {
+       acceleration_status         = (known after apply)
+       acl                         = "private"
+       arn                         = (known after apply)
+       bucket                      = (known after apply)
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = "terraform-"
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags_all                    = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       lifecycle_rule {
+           enabled = true
+           id      = (known after apply)

+           noncurrent_version_expiration {
+               days = 90
            }

+           noncurrent_version_transition {
+               days          = 30
+               storage_class = "STANDARD_IA"
            }

+           transition {
+               days          = 30
+               storage_class = "STANDARD_IA"
            }
        }

+       server_side_encryption_configuration {
+           rule {
+               apply_server_side_encryption_by_default {
+                   sse_algorithm = "AES256"
                }
            }
        }

+       versioning {
+           enabled    = true
+           mfa_delete = false
        }
    }

  # aws_s3_bucket_policy.cloudtrail will be created
+ resource "aws_s3_bucket_policy" "cloudtrail" {
+       bucket = (known after apply)
+       id     = (known after apply)
+       policy = (known after apply)
    }

  # aws_s3_bucket_public_access_block.cloudtrail will be created
+ resource "aws_s3_bucket_public_access_block" "cloudtrail" {
+       block_public_acls       = true
+       block_public_policy     = true
+       bucket                  = (known after apply)
+       id                      = (known after apply)
+       ignore_public_acls      = true
+       restrict_public_buckets = false
    }

  # aws_s3_bucket_public_access_block.terraform will be created
+ resource "aws_s3_bucket_public_access_block" "terraform" {
+       block_public_acls       = true
+       block_public_policy     = true
+       bucket                  = (known after apply)
+       id                      = (known after apply)
+       ignore_public_acls      = true
+       restrict_public_buckets = false
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ cloudtrail_bucket_id = (known after apply)
+ terraform_bucket_id  = (known after apply)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d root`
* :put_litter_in_its_place: To **delete** this plan click [here](https://tombstone.osborn.io:4141/lock?id=nosborn%252Finfrastructure%252Froot%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d root`
</details>
Plan: 10 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
